package wo1261931780.stjavaSE.history.ab_history_20211002.bbb010学生类和方法;

public class bbb001面向对象基础 {
	/**
	 * 对象是数据信息，类是对象的数据的类型
	 * <p>
	 * 对象是具体的，类是抽象的。
	 * <p>
	 * 简单来说，对象是一个东西所代表的数据，而计算机会从数据的种类/类型，来理解这个东西――理解这个数据。
	 * <p>
	 * 属性是某个对象/东西，拥有的特征，每个属性是用值来表示。
	 * <p>
	 * 比如一个手机，他的属性是价格，价格的值是3000。
	 * <p>
	 * 行为，就是对象能执行的操作――对象能做的事情。
	 * <p>
	 * 对于计算机来说，类是对象的抽象，对象是类的实体。
	 * <p>
	 * 类，就是手机这种东西。
	 * <p>
	 * 对象，就是华为mate40 pro，小米mix3，这种具体的东西。
	 * <p>
	 * 属性，就是对象（mix3手机）的价格，比如3000或者5000。
	 * <p>
	 * 行为，就是对象（mix3手机）的功能，打电话，玩游戏这种。
	 * <p>
	 * --------------------------------------------------------
	 * <p>
	 * <p>
	 * //类，是java的基本单位。
	 * <p>
	 * //类是由属性和行为抽象得到的，换句话来说，两个对象的属性和行为相同，那么我们可以将它归为一类。
	 * <p>
	 * //类=属性+行为
	 * <p>
	 * //属性，通过变量表现，所以可以控制变量来控制属性。
	 * <p>
	 * //行为，通过方法表现。
	 * <p>
	 * string huawei;
	 * <p>
	 * huawei 是字符串类型的变量，所以直接定义。
	 * <p>
	 * int 6800；
	 * <p>
	 * 6800是价格，因为是数字类型的变量，所以int。
	 * <p>
	 * public void call(){
	 * <p>
	 * //这里没有static，就是在定义方法。
	 * <p>
	 * //方法的名称是call。
	 * <p>
	 * System.out.println("打电话");
	 * <p>
	 * //--------------------------------------------------------
	 * //--------------------------------------------------------
	 * Random xx= new random();
	 * <p>
	 * //类---xx是对象---类名();
	 * <p>
	 * //一个class就是一个类。
	 * <p>
	 * //类的名称可以自己定义，但是最好英文，同时因为是另一个class中的，所以要说清楚。
	 * <p>
	 * int x1 = xx.nextInt(100);
	 * <p>
	 * //定义x1，对象是xx，方法名是nextInt。
	 * }
	 * <p>
	 * 测试类都有一个main方法。
	 */
	public static void main(String[] args) {
		System.out.println("结束");
	}
}
